import { NextPage } from "next";
import { Const } from "lib/const";

const policy = `
株式会社マカセテ（以下「当社」といいます。）は、当社の提供するサービス（以下「本サービス」といいます。）における、 ユーザーについての個人情報を含む利用者情報の取扱いについて、 以下のとおりプライバシーポリシー（以下「本ポリシー」といいます。）を定めます。

1.収集する利用者情報及び収集方法

本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に係る情報、通信サービス上の行動履歴、 その他ユーザーのスマートフォン、PC等の端末においてユーザーまたはユーザーの端末に関連して生成または蓄積された情報であって、 本ポリシーに基づき当社が収集するものを意味するものとします。
本サービスにおいて当社が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。

⑴ユーザーからご提供いただく情報

ユーザーが本サービスを利用するために、ご提供いただく情報は以下のとおりです。

・当社が定める入力フォームにユーザーが入力する情報

⑵ユーザーが本サービスの利用において、他のサービスと連携を許可することにより、当該他のサービスからご提供いただく情報

ユーザーが、本サービスを利用するにあたり、ソーシャルネットワークサービス等の外部サービスとの連携を許可した場合には、 その許可の際にご同意いただいた内容に基づき、以下の情報を当該外部サービスから収集します。

・当該外部サービスでユーザーが利用するID
・その他当該外部サービスのプライバシー設定によりユーザーが連携先に開示を認めた情報

⑶ユーザーが本サービスを利用するにあたって、当社が収集する情報

当社は、本サービスへのアクセス状況やそのご利用方法に関する情報を収集することがあります。これには以下の情報が含まれます。

・端末情報
・ログ情報
・Cookie及び匿名ID
・位置情報


2.利用目的

2-1 利用者情報は、2-2に定めるとおり本サービスの提供のために利用されるほか、2-3に定めるとおり、その他の目的にも利用される場合があります。

2-2 本サービスのサービス提供にかかわる利用者情報の具体的な利用目的は以下のとおりです。

1. 本サービスに関する登録の受付、本人確認、利用料金の計算等本サービスの提供、維持、保護及び改善のため
2. 本サービスに関するご案内、お問い合せ等への対応のため
3. 本サービスに関する当社の規約、ポリシー等（以下「規約等」といいます。）に違反する行為に対する対応のため
4. 本サービスに関する規約等の変更などを通知するため
5. 上記の利用目的に付随する利用目的のため

2-3 上記2-2以外の利用目的は以下のとおりです。

利用目的(1)
当社のサービスに関連して、個人を識別できない形式に加工した統計データを作成するため

対応する利用者情報の項目

1. 端末情報
2. ログ情報
3. Cookie及び匿名ID
4. 位置情報
5. 購買データ

利用目的(2)
当社または第三者の広告の配信または表示のため

対応する利用者情報の項目

1. 端末情報
2. ログ情報
3. Cookie及び匿名ID
4. 位置情報
5. 購買データ

利用目的(3)
その他マーケティングに利用するため

対応する利用者情報の項目

1. 当社が定める入力フォームに ユーザーが入力する情報


3.通知・公表または同意取得の方法、利用中止要請の方法

3-1 以下の利用者情報については、その収集が行われる前にユーザーの同意を得るものとします。

⑴ 端末情報
⑵ 位置情報

3-2 ユーザーは、本サービスの所定の設定を行うことにより、利用者情報の全部または一部についてその利用の停止を求めることができ、この場合、当社は速やかに、当社の定めるところに従い、その利用を停止します。なお利用者情報の項目によっては、その収集または利用が本サービスの前提となるため、当社所定の方法により本サービスを退会した場合に限り、当社はその収集を停止します。


4.外部送信、第三者提供、情報収集モジュールの有無
利用者情報を利用したターゲティング広告の配信のため、本サービスには以下の情報収集モジュールが組み込まれています。 これに伴い、以下のとおり情報収集モジュール提供者への利用者情報の提供を行います。

1. 情報収集モジュールの名称
2. 情報収集モジュールの提供者
3. 提供される利用者情報の項目
4. 提供の手段・方法
5. 上記提供者における利用目的
6. 上記提供者における第三者提供の有無
7. 上記提供者のプライバシーポリシーのURL


5.第三者提供
当社は、利用者情報のうち、個人情報については、 個人情報保護法その他の法令に基づき開示が認められる場合を除くほか、 あらかじめユーザーの同意を得ないで、第三者に提供しません。但し、次に掲げる場合はこの限りではありません。

1. 当社が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
2. 合併その他の事由による事業の承継に伴って個人情報が提供される場合
3. 第4項の定めに従って、情報収集モジュール提供者へ個人情報が提供される場合
4. 国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザーの同意を得ることによって当該事務の遂行に支障を及ぼすおそれがある場合
5. その他、個人情報保護法その他の法令で認められる場合


6.共同利用
当社は、以下のとおりユーザーの個人情報を共同利用します。

1. 共同して利用される個人情報の項目
2. 共同して利用する者の範囲
3. 共同して利用する者の利用目的
4. 利用者情報の管理について責任を有する者の氏名または名称


7.個人情報の開示
当社は、ユーザーから、個人情報保護法の定めに基づき個人情報の開示を求められたときは、 ユーザーご本人からのご請求であることを確認の上で、ユーザーに対し、 遅滞なく開示を行います（当該個人情報が存在しないときにはその旨を通知いたします。）。 但し、個人情報保護法その他の法令により、当社が開示の義務を負わない場合は、この限りではありません。 なお、個人情報の開示につきましては、手数料（1件あたり1,000円）を頂戴しておりますので、あらかじめ御了承ください。


8.個人情報の訂正及び利用停止等

8-1 当社は、ユーザーから、 ⑴個人情報が真実でないという理由によって個人情報保護法の定めに基づきその内容の訂正を求められた場合、 及び⑵あらかじめ公表された利用目的の範囲を超えて取り扱われているという理由または偽りその他不正の手段により収集されたものであるという理由により、個人情報保護法の定めに基づきその利用の停止を求められた場合には、ユーザーご本人からのご請求であることを確認の上で遅滞なく必要な調査を行い、その結果に基づき、個人情報の内容の訂正または利用停止を行い、その旨をユーザーに通知します。 なお、合理的な理由に基づいて訂正または利用停止を行わない旨の決定をしたときは、ユーザーに対しその旨を通知いたします。

8-2 当社は、ユーザーから、ユーザーの個人情報について消去を求められた場合、 当社が当該請求に応じる必要があると判断した場合は、ユーザーご本人からのご請求であることを確認の上で、 個人情報の消去を行い、その旨をユーザーに通知します。

8-3 個人情報保護法その他の法令により、当社が訂正等または利用停止等の義務を負わない場合は、前2項の規定は適用されません。


9. 他サービスの経由での情報取得に関して
当社では、本サービスの品質向上、または広告や販売の効果を測定するために、 他社が提供するサービスを経由して、情報を取得・分析をしております。設置しているサービスは以下になります。

Firebase

設置しているサービス：${Const.SERVICE_NAME}
提供者名 : Google Inc.
利用サービス：Firebase Analytics
Firebase利用規約： https://firebase.google.com/terms/
利用目的：利用状況の分析のため
第三者提供 / 共同利用：なし


10.お問い合わせ窓口
ご意見、ご質問、苦情のお申出その他利用者情報の取扱いに関するお問い合わせは、下記の窓口までお願い致します。

株式会社マカセテ
E-mail：hello[at]makasete.co.jp


11.プライバシーポリシーの変更手続
当社は、利用者情報の取扱いに関する運用状況を適宜見直し、継続的な改善に努めるものとし、 必要に応じて、本ポリシーを変更することがあります。 変更した場合には、公式サイト上でユーザーに通知いたします。 但し、法令上ユーザーの同意が必要となるような内容の変更の場合は、当社所定の方法でユーザーの同意を得るものとします。
`

const PrivacyPolicyPage: NextPage = () => {
  return (
    <div style={{ whiteSpace: 'pre-wrap' }}>
      {policy}
    </div>
  )
}

export default PrivacyPolicyPage
